// BibleNames.ts

const bibleNames: { [key: string]: string } = {
  "창 1:1": "1. 태초에 하나님이 천지를 창조하시니라",
  "창 1:2":
    "2. 땅이 혼돈하고 공허하며 흑암이 깊음 위에 있고 하나님의 영은 수면 위에 운행하시니라",
  "창 1:3": "3. 하나님이 이르시되 빛이 있으라 하시니 빛이 있었고",
  "창 1:4": "4. 하나님이 그 빛이 좋음을 보시고 빛과 어둠을 나누사",
  "창 1:5":
    "5. 하나님이 빛을 낮이라 칭하시고 어둠을 밤이라 칭하시니라 저녁이 되고 아침이 되니 이는 첫째 날이니라",
  "창 1:6":
    "6. 하나님이 이르시되 물 가운데에 궁창이 있어 물과 물로 나뉘라 하시고",
  "창 1:7":
    "7. 하나님이 궁창을 만드사 궁창 아래의 물과 궁창 위의 물로 나뉘게 하시니 그대로 되니라",
  "창 1:8":
    "8. 하나님이 궁창을 하늘이라 칭하시니라 저녁이 되고 아침이 되니 이는 둘째 날이니라",
  "창 1:9":
    "9. 하나님이 이르시되 천하의 물이 한 곳으로 모이고 뭍이 드러나라 하시니 그대로 되니라",
  "창 1:10":
    "10. 하나님이 뭍을 땅이라 칭하시고 모인 물을 바다라 칭하시니 하나님이 보시기에 좋았더라",
  "창 1:11":
    "11. 하나님이 이르시되 땅은 풀과 씨 맺는 채소와 각기 종류대로 씨 가진 열매 맺는 나무를 내라 하시니 그대로 되니라",
  "창 1:12":
    "12. 땅이 풀과 각기 종류대로 씨 맺는 채소와 각기 종류대로 씨 가진 열매 맺는 나무를 내니 하나님이 보시기에 좋았더라",
  "창 1:13": "13. 저녁이 되고 아침이 되니 이는 셋째 날이니라",
  "창 1:14":
    "14. 하나님이 이르시되 하늘의 궁창에 광명이 있어 낮과 밤을 나누게 하고 그것들로 징조와 계절과 날과 해를 이루게 하라",
  "창 1:15":
    "15. 또 그 광명이 하늘의 궁창에 있어 땅에 비추라 하시니 그대로 되니라",
  "창 1:16":
    "16. 하나님이 두 큰 광명을 만드사 큰 광명으로 낮을 주관하게 하시고 작은 광명으로 밤을 주관하게 하시며 또 별들을 만드시고",
  "창 1:17": "17. 하나님이 그것들을 하늘의 궁창에 두어 땅에 비추게 하시며",
  "창 1:18":
    "18. 낮과 밤을 주관하게 하시고 빛과 어둠을 나누게 하시니 하나님이 보시기에 좋았더라",
  "창 1:19": "19. 저녁이 되고 아침이 되니 이는 넷째 날이니라",
  "창 1:20":
    "20. 하나님이 이르시되 물들은 생물로 번성하게 하라 땅 위 하늘의 궁창에는 새가 나르라 하시고",
  "창 1:21":
    "21. 하나님이 큰 바다 짐승들과 물에서 번성하여 움직이는 모든 생물을 그 종류대로, 날개 있는 모든 새를 그 종류대로 창조하시니 하나님이 보시기에 좋았더라",
  "창 1:22":
    "22. 하나님이 그들에게 복을 주어 이르시되 생육하고 번성하여 여러 바다의 물에 충만하라 새들도 땅에 번성하라 하시니라",
  "창 1:23": "23. 저녁이 되고 아침이 되니 이는 다섯째 날이니라",
  "창 1:24":
    "24. 하나님이 이르시되 땅은 생물을 그 종류대로 내되 가축과 기는 것과 땅의 짐승을 각기 종류대로 내라 하시니 그대로 되니라",
  "창 1:25":
    "25. 하나님이 땅의 짐승을 그 종류대로, 가축을 그 종류대로, 땅에 기는 모든 것을 그 종류대로 만드시니 하나님이 보시기에 좋았더라",
  "창 1:26":
    "26. 하나님이 이르시되 우리의 형상을 따라 우리의 모양대로 우리가 사람을 만들고 그들이 바다의 물고기와 하늘의 새와 가축과 온 땅과 땅에 기는 모든 것을 다스리게 하자 하시고",
  "창 1:27":
    "27. 하나님이 자기 형상 곧 하나님의 형상대로 사람을 창조하시되 남자와 여자를 창조하시고",
  "창 1:28":
    "28. 하나님이 그들에게 복을 주시며 하나님이 그들에게 이르시되 생육하고 번성하여 땅에 충만하라 땅을 정복하라 바다의 물고기와 하늘의 새와 땅에 움직이는 모든 생물을 다스리라 하시니라",
  "창 1:29":
    "29. 하나님이 이르시되 내가 온 지면의 씨 맺는 모든 채소와 씨 가진 열매 맺는 모든 나무를 너희에게 주노니 너희의 먹을거리가 되리라",
  "창 1:30":
    "30. 또 땅의 모든 짐승과 하늘의 모든 새와 생명이 있어 땅에 기는 모든 것에게는 내가 모든 푸른 풀을 먹을거리로 주노라 하시니 그대로 되니라",
  "창 1:31":
    "31. 하나님이 지으신 그 모든 것을 보시니 보시기에 심히 좋았더라 저녁이 되고 아침이 되니 이는 여섯째 날이니라",

  "창 2:1": "1. 천지와 만물이 다 이루어지니라",
  "창 2:2":
    "2. 하나님이 그가 하시던 일을 일곱째 날에 마치시니 그가 하시던 모든 일을 그치고 일곱째 날에 안식하시니라",
  "창 2:3":
    "3. 하나님이 일곱째 날을 복되게 하사 거룩하게 하셨으니 이는 하나님이 그 창조하시며 만드시던 모든 일을 마치시고 그 날에 안식하셨음이니라",
  "창 2:4":
    "4. 이것이 천지가 창조될 때의 하늘과 땅의 내력이니 여호와 하나님이 땅과 하늘을 만드실 때에",
  "창 2:5":
    "5. 여호와 하나님이 땅에 비를 내리지 아니하셨고 땅을 갈 사람도 없었으므로 들에는 초목이 없었고 밭에는 채소가 나지 아니하였으며",
  "창 2:6": "6. 안개만 땅에서 올라와 온 지면을 적셨더라",
  "창 2:7":
    "7. 여호와 하나님이 땅의 흙으로 사람을 지으시고 생기를 그의 코에 불어넣으시니 사람이 생령이 되니라",
  "창 2:8":
    "8. 여호와 하나님이 동방에 에덴에 동산을 창설하시고 그가 지으신 사람을 거기에 두시니라",
  "창 2:9":
    "9. 여호와 하나님이 그 땅에서 보기에 아름답고 먹기에 좋은 나무가 나게 하시니 동산 가운데에는 생명나무와 선악을 알게 하는 나무도 있더라",
  "창 2:10":
    "10. 강이 에덴에서 흘러나와 동산을 적시고 거기서부터 갈라져 네 근원이 되었으니",
  "창 2:11": "11. 첫째의 이름은 비손이라 금이 있는 하윌라 온 땅을 둘렀으며",
  "창 2:12": "12. 그 땅의 금은 순금이요 그곳에는 베델리엄과 호마노도 있으며",
  "창 2:13": "13. 둘째 강의 이름은 기혼이라 구스 온 땅을 둘렀고",
  "창 2:14":
    "14. 셋째 강의 이름은 힛데겔이라 앗수르 동쪽으로 흘렀으며 넷째 강은 유브라데더라",
  "창 2:15":
    "15. 여호와 하나님이 그 사람을 이끌어 에덴 동산에 두어 그것을 경작하며 지키게 하시고",
  "창 2:16":
    "16. 여호와 하나님이 그 사람에게 명하여 이르시되 동산 각종 나무의 열매는 네가 임의로 먹되",
  "창 2:17":
    "17. 선악을 알게 하는 나무의 열매는 먹지 말라 네가 먹는 날에는 반드시 죽으리라 하시니라",
  "창 2:18":
    "18. 여호와 하나님이 이르시되 사람이 혼자 있는 것이 좋지 아니하니 내가 그를 위하여 돕는 배필을 지으리라 하시니라",
  "창 2:19":
    "19. 여호와 하나님이 흙으로 각종 들짐승과 공중의 각종 새를 지으시고 아담이 그것들에게 이름을 무엇이라 하느냐에 따라 각 생물을 부르게 하시니",
  "창 2:20":
    "20. 아담이 모든 가축과 공중의 새와 들의 모든 짐승에게 이름을 주니라 그러나 아담에게는 돕는 배필이 없었더라",
  "창 2:21":
    "21. 여호와 하나님이 아담을 깊이 잠들게 하시니 잠들매 그가 그 갈빗대 하나를 취하고 살로 대신 채우시고",
  "창 2:22":
    "22. 여호와 하나님이 아담에게서 취하신 그 갈빗대로 여자를 만드시고 그를 아담에게로 이끌어 오시니",
  "창 2:23":
    "23. 아담이 이르되 이는 내 뼈 중의 뼈요 살 중의 살이라 이것을 남자에게서 취하였은즉 여자라 부르리라 하니라",
  "창 2:24":
    "24. 이러므로 남자가 부모를 떠나 그의 아내와 합하여 둘이 한 몸을 이룰지로다",
  "창 2:25":
    "25. 아담과 그의 아내 두 사람이 벌거벗었으나 부끄러워하지 아니하니라",
};

export default bibleNames;
